app/controllers/tasks_controller.rb

  def index
    @banana = Task.all
---
SELECT "tasks".* FROM "tasks"

  def show
    @id = params[:id].to_i
    @task = Task.find_by(id: @id)
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]

  def create
    @task = Task.new(name: params[:task][:name], description: params[:task][:description], completion_date: params[:task][:completion_date]) #instantiate a new book
    if @task.save # save returns true if the database insert succeeds
---
INSERT INTO "tasks" ("name", "description", "completion_date", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Reading"], ["description", "read!"], ["completion_date", "2018/09/31"], ["created_at", "2018-09-23 02:52:51.386914"], ["updated_at", "2018-09-23 02:52:51.386914"]]

  def edit
    @task = Task.find_by(id: params[:id].to_i)
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def update
    @task = Task.find_by(id: params[:id].to_i)
    @task.update(name: params[:task][:name],
      description: params[:task][:description],
      completion_date: params[:task][:completion_date])
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]
UPDATE "tasks" SET "description" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["description", "Catch up on Leadership Development Reading"], ["updated_at", "2018-09-24 11:55:59.636476"], ["id", 4]]

    def destroy
      @task = Task.find_by(id: params[:id].to_i)
      @task.destroy
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
DELETE FROM "tasks" WHERE "tasks"."id" = ?  [["id", 4]]